perf/results/cassandra/read_50rps.txt
Running 30s test @ http://localhost:9411
  2 threads and 20 connections
  Thread calibration: mean lat.: 17.040ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 16.130ms, rate sampling interval: 17ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.67ms    2.15ms  20.14ms   79.69%
    Req/Sec    26.07     67.18   315.00     87.37%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.17ms
 75.000%    4.34ms
 90.000%    6.43ms
 99.000%   11.15ms
 99.900%   16.09ms
 99.990%   20.16ms
 99.999%   20.16ms
100.000%   20.16ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.468     0.000000            1         1.00
       1.623     0.100000           98         1.11
       2.111     0.200000          196         1.25
       2.471     0.300000          294         1.43
       2.853     0.400000          392         1.67
       3.167     0.500000          490         2.00
       3.343     0.550000          539         2.22
       3.545     0.600000          588         2.50
       3.735     0.650000          637         2.86
       4.037     0.700000          686         3.33
       4.339     0.750000          735         4.00
       4.539     0.775000          761         4.44
       4.759     0.800000          784         5.00
       5.075     0.825000          809         5.71
       5.439     0.850000          833         6.67
       5.951     0.875000          858         8.00
       6.199     0.887500          870         8.89
       6.427     0.900000          882        10.00
       6.679     0.912500          895        11.43
       6.951     0.925000          907        13.33
       7.227     0.937500          919        16.00
       7.331     0.943750          925        17.78
       7.471     0.950000          931        20.00
       7.867     0.956250          938        22.86
       8.171     0.962500          944        26.67
       8.623     0.968750          950        32.00
       9.183     0.971875          953        35.56
       9.487     0.975000          956        40.00
       9.623     0.978125          959        45.71
       9.831     0.981250          962        53.33
      10.143     0.984375          965        64.00
      10.455     0.985938          967        71.11
      10.495     0.987500          968        80.00
      11.151     0.989062          970        91.43
      11.543     0.990625          971       106.67
      13.679     0.992188          973       128.00
      14.183     0.992969          974       142.22
      14.183     0.993750          974       160.00
      14.199     0.994531          975       182.86
      14.303     0.995313          976       213.33
      14.575     0.996094          977       256.00
      14.575     0.996484          977       284.44
      14.575     0.996875          977       320.00
      15.039     0.997266          978       365.71
      15.039     0.997656          978       426.67
      16.087     0.998047          979       512.00
      16.087     0.998242          979       568.89
      16.087     0.998437          979       640.00
      16.087     0.998633          979       731.43
      16.087     0.998828          979       853.33
      20.159     0.999023          980      1024.00
      20.159     1.000000          980          inf
#[Mean    =        3.666, StdDeviation   =        2.151]
#[Max     =       20.144, Total count    =          980]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1502 requests in 30.01s, 287.73KB read
  Non-2xx or 3xx responses: 118
Requests/sec:     50.06
Transfer/sec:      9.59KB