perf/results/cassandra/read_50rps.txt
Running 30s test @ http://localhost:9411
  2 threads and 20 connections
  Thread calibration: mean lat.: 741.756ms, rate sampling interval: 5455ms
  Thread calibration: mean lat.: 739.056ms, rate sampling interval: 5427ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.15ms    5.44ms  52.83ms   91.24%
    Req/Sec    24.17      0.69    25.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.54ms
 75.000%    6.04ms
 90.000%    9.81ms
 99.000%   30.14ms
 99.900%   49.18ms
 99.990%   52.86ms
 99.999%   52.86ms
100.000%   52.86ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.432     0.000000            1         1.00
       1.746     0.100000           99         1.11
       2.201     0.200000          197         1.25
       2.565     0.300000          295         1.43
       2.973     0.400000          393         1.67
       3.537     0.500000          492         2.00
       3.775     0.550000          541         2.22
       4.207     0.600000          590         2.50
       4.687     0.650000          640         2.86
       5.283     0.700000          688         3.33
       6.035     0.750000          738         4.00
       6.551     0.775000          762         4.44
       6.963     0.800000          786         5.00
       7.479     0.825000          811         5.71
       7.887     0.850000          835         6.67
       8.791     0.875000          860         8.00
       9.287     0.887500          872         8.89
       9.815     0.900000          884        10.00
      10.615     0.912500          897        11.43
      11.367     0.925000          909        13.33
      12.071     0.937500          921        16.00
      12.375     0.943750          927        17.78
      12.855     0.950000          934        20.00
      13.167     0.956250          940        22.86
      13.839     0.962500          946        26.67
      15.943     0.968750          952        32.00
      17.487     0.971875          955        35.56
      19.375     0.975000          958        40.00
      21.039     0.978125          961        45.71
      23.775     0.981250          964        53.33
      26.431     0.984375          967        64.00
      27.039     0.985938          969        71.11
      29.327     0.987500          970        80.00
      30.143     0.989062          972        91.43
      30.207     0.990625          973       106.67
      34.943     0.992188          975       128.00
      36.607     0.992969          976       142.22
      36.607     0.993750          976       160.00
      41.247     0.994531          977       182.86
      42.655     0.995313          978       213.33
      46.335     0.996094          979       256.00
      46.335     0.996484          979       284.44
      46.335     0.996875          979       320.00
      48.799     0.997266          980       365.71
      48.799     0.997656          980       426.67
      49.183     0.998047          981       512.00
      49.183     0.998242          981       568.89
      49.183     0.998437          981       640.00
      49.183     0.998633          981       731.43
      49.183     0.998828          981       853.33
      52.863     0.999023          982      1024.00
      52.863     1.000000          982          inf
#[Mean    =        5.155, StdDeviation   =        5.438]
#[Max     =       52.832, Total count    =          982]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1503 requests in 30.02s, 243.86KB read
  Socket errors: connect 0, read 0, write 0, timeout 20
  Non-2xx or 3xx responses: 118
Requests/sec:     50.07
Transfer/sec:      8.12KB